app/controllers/check_controller.rb

  def state
    @user = User.find(session[:user_id])
    @nowpay = Pay.all
    @nowincome = Income.all
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
SELECT "pays".* FROM "pays"
SELECT "incomes".* FROM "incomes"