app/controllers/incomes_controller.rb

SELECT "incomes".* FROM "incomes"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def index
    @incomes = Income.all
    @user = User.find(session[:user_id])

SELECT "incomes".* FROM "incomes" WHERE "incomes"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @income = Income.find(params[:id])

SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1
---
  def new
    @income = Income.new
    @user = User.find(session[:user_id])

INSERT INTO "incomes" ("created_at", "date", "goods_type", "memo", "name", "price", "uname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @income = Income.new(params[:income])

    respond_to do |format|
      if @income.save