app/controllers/manage_controller.rb

  def index
    #--- get login user's name ---#
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" IS NULL LIMIT 1