app/controllers/pays_controller.rb

  def index
    @pays = Pay.all
    @nowuser = User.find(session[:user_id])
---
SELECT "pays".* FROM "pays"
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def show
    @pay = Pay.find(params[:id])
---
SELECT "pays".* FROM "pays" WHERE "pays"."id" = ? LIMIT 1  [["id", "1"]]

  def new
    @pay = Pay.new
    @user = User.find(session[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def edit
    @pay = Pay.find(params[:id])
    @user = User.find(session[:user_id])
---
SELECT "pays".* FROM "pays" WHERE "pays"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "users".* FROM "users" WHERE "users"."id" = 1 LIMIT 1

  def create
    @pay = Pay.new(params[:pay])

#--- save imege file to /public/image/. and assign filename to Pay table ---#
    if params[:image]
      fi = params[:image]
      imagename = fi.original_filename
      File.open("public/image/#{imagename}", 'wb') { |im| im.write(fi.read) }
      @pay.image_url = imagename
    end

#--- save receipt image to /public/receipt/. and assign filename to Pay table---#
    if params[:receipt]
      fr = params[:receipt]
      receiptname = fr.original_filename
      File.open("public/receipt/#{receiptname}", 'wb') { |rm| rm.write(fr.read) }
      @pay.receipt_url = receiptname
    end

    respond_to do |format|
      if @pay.save
---
INSERT INTO "pays" ("created_at", "date", "goods_type", "image_url", "memo", "name", "price", "receipt_url", "uname", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @pay = Pay.find(params[:id])

    respond_to do |format|
      if @pay.update_attributes(params[:pay])
---
SELECT "pays".* FROM "pays" WHERE "pays"."id" = ? LIMIT 1  [["id", "2"]]
UPDATE "pays" SET "date" = '2011-01-13', "updated_at" = '2012-01-13 00:08:34.124985' WHERE "pays"."id" = 2

  def destroy
    @pay = Pay.find(params[:id])
    @pay.destroy
---
SELECT "pays".* FROM "pays" WHERE "pays"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "pays" WHERE "pays"."id" = ?  [["id", 1]]